Catalogs/РегистрЛекарственныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>РегистрЛекарственныхСредств</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДействующиеВеществаМНН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействующиеВеществаМНН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговоеНаименование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеНаименования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаВыпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыВыпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФирмаПроизводитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроизводителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФирмаРегистратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистратора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФирмаУпаковщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаУпаковщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДозВУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОписаниеВБазеРЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРЛС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмеренияКАТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АТХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АТХКлассификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фармдействие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фармдействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРосздравнадзора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПКУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйКодРосздравнадзора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварыФармРынка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварыФармацевтическогоРынка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияСрокаГодности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКомплекте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКомплектеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФармакоТерапевтическаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФармакоТерапевтическиеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезрецептурныйОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖНВЛП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпискиЖНВЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДЛО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наркотические</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпискиНаркотическихВеществ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СильнодействующиеИЯды</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпискиСильнодействующихИЯдовитыхВеществ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпискиАиБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпискиАиБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативныйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РЛС_Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФармакологическиеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФармакологическаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФармакологическиеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомпонентныйСостав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействующееВещество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДВЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доза</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РегистрЛекарственныхСредств/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКИ СОБЫТИЙ
#Область ОбработкиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	НепроверяемыеРеквизиты.Добавить("ТорговоеНаименование");
	НепроверяемыеРеквизиты.Добавить("ДействующиеВеществаМНН");
	
	Если Не ЗначениеЗаполнено(ТорговоеНаименование) И Не ЗначениеЗаполнено(ДействующиеВеществаМНН) Тогда
		ТекстСообщения = НСтр("ru='Необходимо указать ""Торговое наименование"" или ""Действующие вещества(МНН)"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ТорговоеНаименование",, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СрокГодности) Тогда
		ПроверяемыеРеквизиты.Добавить("ЕдиницаИзмеренияСрокаГодности");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НомерРЛС = 0;
	СсылкаНаОписаниеВБазеРЛС = "";
	ДатаОбновления = Дата(1, 1, 1);
	
	КодРосздравнадзора = 0;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Наименование = НаименованиеПолное;
	
	Если ЗначениеЗаполнено(ТорговоеНаименование) Тогда
		ДействующиеВеществаМННТорговогоНаименования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговоеНаименование, "ДействующиеВеществаМНН");
		Если ДействующиеВеществаМНН <> ДействующиеВеществаМННТорговогоНаименования Тогда
			ДействующиеВеществаМНН = ДействующиеВеществаМННТорговогоНаименования;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		Штрихкод = СокрЛП(СтрЗаменить(Штрихкод, Символы.ПС, ""));
		СписокШтрихкодов = СтрРазделить(Штрихкод, ",", Ложь);
		СписокШтрихкодов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СписокШтрихкодов);
		Штрихкоды.Очистить();
		Для Каждого ШтрихкодСписка Из СписокШтрихкодов Цикл
			Если Не ПустаяСтрока(ШтрихкодСписка) Тогда
				Штрихкоды.Добавить().Штрихкод = СокрЛП(ШтрихкодСписка);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Штрихкоды.Количество() > 0 Тогда
			Штрихкоды.Очистить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Справочники.РегистрЛекарственныхСредств.ЗаполнитьУпаковкиПрепарата(Ссылка);
	ОбновитьДанныеСвязаннойНоменклатуры(Отказ);	
	
КонецПроцедуры

#КонецОбласти // ОбработкиСобытий

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

// Процедура обновляет данные номенклатуры по элементу КАТ
//
Процедура ОбновитьДанныеСвязаннойНоменклатуры(Отказ)
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	НоменклатураСсылка = АптечныеТовары.ПолучитьНоменклатуруПоЭлементуКАТ(Ссылка);
	
	//бит
	РЛС_Служебный.УстановитьЗначениеДопРеквизитаВОбъекте(НоменклатураСсылка, ЭтотОбъект);
	//бит
	
	Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
		
		ПереносимыеРеквизиты = Новый Структура;
//		ПереносимыеРеквизиты.Вставить("Упаковка", Упаковка);
		ПереносимыеРеквизиты.Вставить("ГруппаПКУ", ГруппаПКУ);
		//бит_Кирилин_20.10.23
		Если ЗначениеЗаполнено(ГруппаПКУ) Тогда
			ГруппаСписка = Справочники.Номенклатура.НайтиПоНаименованию(ГруппаПКУ.Наименование);
			Если ГруппаСписка = Справочники.Номенклатура.ПустаяСсылка() Тогда
				ГруппаСписка = Справочники.Номенклатура.СоздатьГруппу();
				ГруппаСписка.Наименование = ГруппаПКУ.Наименование;
				ГруппаСписка.Записать();
			КонецЕсли;
			ПереносимыеРеквизиты.Вставить("Родитель", ГруппаСписка.Ссылка);
		Иначе
			ГруппаСписка = Справочники.Номенклатура.НайтиПоНаименованию("Лекарственные препараты");
			Если ГруппаСписка = Справочники.Номенклатура.ПустаяСсылка() Тогда
				ГруппаСписка = Справочники.Номенклатура.СоздатьГруппу();
				ГруппаСписка.Наименование = "Лекарственные препараты";
				ГруппаСписка.Записать();
			КонецЕсли;
			ПереносимыеРеквизиты.Вставить("Родитель", ГруппаСписка.Ссылка);
		КонецЕсли;
		//бит_Кирилин_20.10.23
		ПереносимыеРеквизиты.Вставить("Производитель", ФирмаПроизводитель);
		Если ЗначениеЗаполнено(СрокГодности) Тогда
			ПереносимыеРеквизиты.Вставить("СрокГодности", СрокГодности);
			ПереносимыеРеквизиты.Вставить("ЕдиницаИзмеренияСрокаГодности", ЕдиницаИзмеренияСрокаГодности);
		КонецЕсли;
		
		//Если Справочники.ЕдиницыИзмерения.МерныеТипыЕдиницИзмерений().Найти(БазоваяЕдиницаИзмеренияКАТ.ТипЕдиницы) = Неопределено Тогда
		//	ПереносимыеРеквизиты.Вставить("ЕдиницаИзмерения", БазоваяЕдиницаИзмеренияКАТ);
		//КонецЕсли;
		
		НоменклатураОбъект = Неопределено;
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоменклатураСсылка, ОбщегоНазначенияБольничнаяАптекаКлиентСервер.КлючиКоллекции(ПереносимыеРеквизиты));
		Для Каждого Реквизит Из ПереносимыеРеквизиты Цикл
			
			Если Реквизит.Значение <> РеквизитыНоменклатуры[Реквизит.Ключ] Тогда
				Если НоменклатураОбъект = Неопределено Тогда
					НоменклатураОбъект = НоменклатураСсылка.ПолучитьОбъект();
					Попытка
						ЗаблокироватьДанныеДляРедактирования(НоменклатураСсылка);
					Исключение
						ОбщегоНазначения.СообщитьПользователю(
							КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
							ЭтотОбъект,
							,
							,
							Отказ);
						Возврат
					КонецПопытки;
				КонецЕсли;
				НоменклатураОбъект[Реквизит.Ключ] = Реквизит.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НоменклатураОбъект <> Неопределено Тогда
			
			Попытка
				
				НоменклатураОбъект.ДополнительныеСвойства.Свойство("ПропуститьОбновлениеДанныхПрепарата");
				НоменклатураОбъект.Записать();
				РазблокироватьДанныеДляРедактирования(НоменклатураСсылка);
				
			Исключение
				
				РазблокироватьДанныеДляРедактирования(НоменклатураСсылка);
				ОбщегоНазначения.СообщитьПользователю(
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
					ЭтотОбъект,
					,
					,
					Отказ);
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
